<?php
/**
 * Нормалізувати шлях відповідно до сепаратора директорій для поточної операційної системи.
 * Використовуйте `/` або `\` для розділення директорій, а ця функція замінить всі роздільники, що не відповідають поточній ОС, на відповідний.
 * 
 * ***Для використання спеціального роздільника вкладеності (константа NS) типу `>` або `.` скористайтесь іншими функціями: pathNormalize() або pathNormalizePlus().***
 */
function dsNormalize(string $path): string {
    return str_replace(DS === '/' ? '\\' : '/', DS, $path);
}