<?php
/**
 * Отримати коректний шлях замінивши всі роздільники вкладеності (константа NS) типу `>` або `.` на справжній сепаратор директорій для поточної операційної системи.
 * Потрібно використовувати для обробки всіх шляхів (окрім URL) щоб дозволити безпечне перенесення коду між пристроями з різними ОС.
 * 
 * @param string $path для розділення директорій використовувати ТІЛЬКИ знак що відповідає константі NS (наприклад: `path>to>file.php`)
 * 
 * ***Не використовуйте `/` або `\` адже функція їх не приводе у відповідність до ОС - для цього є функція dsNormalize()***
 */
function pathNormalize(string $path): string {
    return str_replace(NS, DS, $path);
}

/**
 * Аналогічно до `pathNormalize()`, але додано підтримку альтернативного зворотного ходу по директоріям.
 * Повертає коректний шлях замінивши всі:
 * - роздільник вкладеності (константа NS) типу `>` або `.` - на справжній сепаратор директорій для поточної операційної системи,
 * - роздільник зворотної вкладеності (константа BNS) типу `<` - на `../` або `..\` в залежності від сепаратора директорій для поточної ОС.
 * Потрібно використовувати для обробки всіх шляхів (окрім URL) щоб дозволити безпечне перенесення коду між пристроями з різними ОС.
 * 
 * @param string $path для розділення директорій використовувати ТІЛЬКИ знаки що відповідає константі NS або BNS (наприклад: `path>to>file.php` або `<path>of>root`)
 * 
 * ***Не використовуйте `/` або `\` адже функція їх не приводе у відповідність до ОС - для цього є функція dsNormalize()***
 */
function pathNormalizePlus(string $path): string {
    return str_replace(NS, DS, str_replace(BNS, '..' . DS, $path));
}